app/controllers/insession_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."auth" = ? LIMIT ?  [["auth", "00a5c683"], ["LIMIT", 1]]
INSERT INTO "sessionrecords" ("joincode", "session_id", "userauth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["joincode", "29d67c8c"], ["session_id", 15], ["userauth", "00a5c683"], ["created_at", "2018-10-10 11:04:35.662194"], ["updated_at", "2018-10-10 11:04:35.662194"]]
---
def started
  if !@hassession.empty?
    genqr(@hassession, @master)
    @user= User.find_by(auth: @master)
    @insession= Sessionrecord.create(joincode: @jcode, session_id: Session.find_by(auth: @hassession).id, userauth: @master)

SELECT  "sessionrecords".* FROM "sessionrecords" WHERE "sessionrecords"."joincode" = ? LIMIT ?  [["joincode", "36607422"], ["LIMIT", 1]]
---
def joins
  if Sessionrecord.find_by(joincode: @joinscode)