app/controllers/sessions_controller.rb

SELECT  1 AS one FROM "tasks" LIMIT ?  [["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."session_id" = ? LIMIT ?  [["session_id", 1], ["LIMIT", 1]]
---
  def show

    @session= Session.find params[:id]         #find by id / find by code - for users/invited ++auth
    if Task.any?