app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."auth" = ? LIMIT ?  [["auth", "bc7b7166"], ["LIMIT", 1]]
---
  def uauth
    if $currentu=User.find_by(auth: params[:auth])

SELECT "users".* FROM "users"
---
  def home
      #@currentu= $currentu ###
      @joins= ''
      @session= Session.new()
      @sessions= Session.all()
      @nosession="active"
      @iscurrent="disabled"
      @utags=[]
      User.all.each do |u|  #maybe not here, not everytime

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."session_id" = ? LIMIT ?  [["session_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "tasks" WHERE "tasks"."session_id" = ? LIMIT ?  [["session_id", 11], ["LIMIT", 1]]
---
  def show

    @session= Session.find params[:id]         #find by id / find by code - for users/invited ++auth
    if @session.tasks.any?