app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "body", "session_id", "created_at", "updated_at", "link") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    create= Task.new(task_params)
    #byebug
    currenthack= "/#current"
     if create.save!